/**
 * @copyright (C) COPYRIGHT 2022 Fortiortech Shenzhen
 * @file      Customer.h
 * @author    Fortiortech  Appliction Team
 * @date      2022-07-13
 * @brief     This file contains all the common data parameter used for Motor Control.
 */
/* Define to prevent recursive inclusion --------------------------------------------------------*/
#ifndef __CUSTOMER_H_
#define __CUSTOMER_H_

 /**********************基础参数*****************************
 1. 芯片参数
 2. 电机参数
 3. 电流采样参数
 4. 母线电压采样参数
  **************************************************************/
/* ----------------------------------------------------------------------------------------------------------------------------
                                             1.芯片参数
---------------------------------------------------------------------------------------------------------------------------- */

#define PWM_FREQUENCY                  (30.0)             //                     ///< (kHz) 载波频率

#define PWM_DEADTIME                   (0.6)                                   ///< (μs)  死区时间

#define MIN_WIND_TIME                  (PWM_DEADTIME+0.6)                      ///< (μs)  单电阻最小采样窗口
/* ----------------------------------------------------------------------------------------------------------------------------

                                             2.电机参数
---------------------------------------------------------------------------------------------------------------------------- */
#define MOTOR_SPEED_BASE               (100000.0)                               ///< (RPM) 速度基准,设置为最大转速的1.5-2倍
#define Pole_Pairs                     (2.0)                                   ///< 极对数
#define RS                             (0.21)             //0.208                    ///< (Ω) 相电阻
#define LD                             (0.000015 )         //0.00003695                  ///< (H) d轴相电感
#define LQ                             (0.000015 )         //0.00003695                  ///< (H) q轴相电感
#define Ke                             (0.27) //0.27                         ///< (V/kRPM) 反电动势常数

/* ----------------------------------------------------------------------------------------------------------------------------
                                             3.电流采样参数
---------------------------------------------------------------------------------------------------------------------------- */

#define HW_RSHUNT                      (0.03)                                  ///< (Ω) 采样电阻
/**
 * @brief  运放模式选择
 * @param (Exter_AMP0)    外部运放
 * @param (Inter_AMP0)    内部PGA双端差分输入( 放大倍数的标定外部引脚串1kΩ电阻)
 */
#define AMP0Mode                       (Inter_AMP0)                            ///< 运放模式选择 

#define HW_ADC_REF                     (5.0)                                   ///(V) ADC参考电压，6832S不可修改，ADD5需要外挂1uf电容
/**
 * @brief  内部运放放大倍数选择
 * @param (AMP0GAIN_2x)       内部PGA放大2倍
 * @param (AMP0GAIN_4x)       内部PGA放大4倍
 * @param (AMP0GAIN_8x)       内部PGA放大8倍
 * @param (AMP0GAIN_16x)      内部PGA放大16倍
 * @param (AMP0GAIN_32x)      内部PGA放大32倍
 */

#define MCU_AMP0GAIN                   (AMP0GAIN_4x)                           ///< 内部运放放大倍数选择（运放模式为内部运放有效，外部运放无效）

#define HW_AMPGAIN                     (3.4)                                   ///< 运放放大倍数设置（无论内部运放还是外部运放均需要配置，配置对应放大倍数即可）    

/**
 * @brief  电流采样模式选择
 * @param (Single_Resistor)    单电阻电流采样模式
 * @param (Double_Resistor)    双电阻电流采样模式
 * @param (Three_Resistor)     三电阻电流采样模式
 */
#define Shunt_Resistor_Mode            (Single_Resistor)                       ///< 电流采样模式选择（6832S引脚资源有限，只能选择单电阻电流采样模式）

/* ----------------------------------------------------------------------------------------------------------------------------
                                             4.母线电压采样参数
---------------------------------------------------------------------------------------------------------------------------- */

/**
 * @brief  母线电压采样模式选择
 * @param (Exter_VOLTAGE)    外部分压（硬件含有母线分压电路，通过AD2采集母线电压）
 * @param (Inter_VOLTAGE)    内部分压（VCC引脚内部有分压电路，通过VCC引脚内部AD14采集母线电压）
 */

#define VOLTAGEMode                    (Inter_VOLTAGE)                         ///< 母线电压采样模式选择

/**
 * @brief  内部分压分压比选择  
 * @param (Ratio_12)        内部分压比（12：1）
 * @param (Ratio_6_5)       内部分压比（6.5：1）
 */

#define VOLTAGE_SCALE                  (Ratio_12)                              ///< 内部分压分压比选择     


#define RV1                            (11.0)                                  ///< (kΩ) 母线电压分压电阻1（无论内部分压还是外部分压均需要配置）
#define RV2                            (0.0)                                   ///< (kΩ) 母线电压分压电阻2（无论内部分压还是外部分压均需要配置）
#define RV3                            (1.0)                                   ///< (kΩ) 母线电压分压电阻3（无论内部分压还是外部分压均需要配置）

 /**********************电机运行参数*****************************
 1.  正反转模式
 2.  预定位参数
 3.  启动参数
 4.  调速模式参数
 5.  环路参数 
 6.  FG输出 
 7.  过调制   
 8.  调速模式
 9.  观测器模式  
 10. 顺逆风模式
 11. 启停测试参数 
 12. 马达工作模式 
 13. 刹车
  **************************************************************/

/* ----------------------------------------------------------------------------------------------------------------------------
                                            1.正反转模式
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 正反转模式选择
 * @param (CW)      正转
 * @param (CCW)     反转
 */
#define SetDirection                   (CCW)                                    ///< 正反转模式选择

/* ----------------------------------------------------------------------------------------------------------------------------
                                              2.预定位参数       
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  预定位测试模式
 * @param (Disable)  禁止
 * @param (Enable)   使能
 */
#define AlignTestMode                  (Disable)                               ///< 预定位测试模式

#define Align_Time                     (200)                                     ///< (ms) 预定位时间

#define Align_Angle                    (0.0)                                   ///< (°) 预定位角度

#define DQKP_Alignment                 _Q12(0.5)                               ///< 预定位kp

#define DQKI_Alignment                 _Q15(0.01)                              ///< 预定位kI

#define ID_Align_CURRENT               I_Value(2.0)                            ///< (A) d轴定位电流

#define IQ_Align_CURRENT               I_Value(0.0)                            ///< (A) q轴定位电流

/* ----------------------------------------------------------------------------------------------------------------------------
                                             3.启动参数
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 启动模式选择
 * @param (Open_Start)        开环强拖启动
 * @param (Omega_Start)       Omega启动，扫地宝Omega启动
 * @param (Open_Omega_Start)  先开环启，后Omega启动
 * @param (PLL_Start)
 */
#define Open_Start_Mode                (Omega_Start)                          

/* -----OMEGA startup parameter----- */
#define Motor_Omega_Ramp_ACC           (4.5)                                   ///< 静止启动时强制速度的爬坡增量 
#define MOTOR_OMEGA_ACC_MIN            (150.0)       //500                     ///< (RPM) 估算转速的最小切换转速
#define MOTOR_OMEGA_ACC_END            (2000.0)                                 ///< (RPM) 强制转速的最大转速

#define MOTOR_SPEED_SMOMIN_RPM         (1000.0)                                 /// (RPM) 滑膜运行最小估算转速

/* -----Startup current----- */
#define ID_Start_CURRENT               I_Value(0.0)                            ///< (A) d轴启动电流
#define IQ_Start_CURRENT               I_Value(3.5)                            ///< (A) q轴启动电流

/* -----PLL start parameters----- */
#define Close_Speed                   (100.0)                                  ///< (RPM) The speed switch to hardware angle estimator
#define E_BW_PLL                      (2100.0)                                  ///< PLL Bandwidth in algorithm
#define PLL_BEMF_BASE                 (4.0)
#define UDC_rated                     (20.0)                                   ///< RatedVoltage


/* -----Current loop coefficient at startup state----- */
#define DQKPStart                      _Q12(0.02)                               ///< 电流环启动kp
#define DQKIStart                      _Q15(0.004)                             ///< 电流环启动kI

/* -----Current loop coefficient after controller switch to mode1----- */
#define DQKP                           _Q12(0.6)                               ///< 电流环运行kp
#define DQKI                           _Q15(0.008)                             ///< 电流环运行kI

/* -----d-Axis voltage reference limit value----- */
#define DOUTMAX                        _Q15(0.99)                              ///< D轴最大限幅值，常用不限制，给0.99；单位：输出占空比
#define DOUTMIN                        _Q15(-0.99)                             ///< D轴最小限幅值，常用不限制，给-0.99；单位：输出占空比

/* -----q-Axis voltage reference limit value----- */
#define QOUTMAX                        _Q15(0.99)                              ///< Q轴最大限幅值，常用不限制，给0.99；单位：输出占空比
#define QOUTMIN                        _Q15(-0.99)                             ///< Q轴最小限幅值，常用不限制，给-0.99；单位：输出占空比

#define QOUTINC                        (5)                                     ///< (A) 电流环目标电流步进值

#define QOUTCURRENT                    (1.0)                                   ///< (A) 电流环目标电流值

/* -----ATO bandwidth----- */
#define ATO_BW                         (20.0)                               ///< (Hz) ATO的带宽设置，经典值为1.0-200.0，AO观测器，第一个ATO会小一点
#define ATO_BW_RUN                     (60.0)
#define ATO_BW_RUN1                    (75.0)
#define ATO_BW_RUN2                    (85.0)
#define ATO_BW_RUN3                    (90.0)
#define ATO_BW_RUN4                    (95.0)

#define ATO_BW_RUNSMO                  (150.0)

/* -----Speed filter bandwidth----- */
#define SPD_BW                         (30.0)                                  ///<  速度滤波的带宽设置，此值不常改，经典值为5.0-40.0

/* The motor speed to switch from mode0 to mode1 */
#define MOTOR_LOOP_RPM                 (2000.0)                                ///< (RPM) 切闭环转速



/* ----------------------------------------------------------------------------------------------------------------------------
                                             4.  PWM调速模式参数    
---------------------------------------------------------------------------------------------------------------------------- */
/* -----On/Off setting----- */
#define OFFPWMDuty                     _Q15(0.05)                              ///< 关机PWM占空比，小于该占空比关机                         
#define OFFPWMDutyHigh                 _Q15(1.0)                               ///< 关机PWM占空比，大于该占空比关机
#define ONPWMDuty                      _Q15(0.08)                              ///< 开机PWM占空比，大于该占空比时开机
#define MINPWMDuty                     _Q15(0.90)                              ///< 速度曲线上最小PWM占空比
#define MAXPWMDuty                     _Q15(0.99)                              ///< 速度曲线上最大PWM占空比

/* ----------------------------------------------------------------------------------------------------------------------------
                                             5. 环路参数  
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 环路使能
 * @param (OUTLoop_Enable)     外环使能
 * @param (OUTLoop_Disable)    外环不使能（电流环）
 */
#define OUTLoop_Mode                   (OUTLoop_Enable)

/**
 * @brief 外环环路选择
 * @param (POWER_LOOP_CONTROL)    功率环
 * @param (SPEED_LOOP_CONTROL)    速度环
 */
#define Motor_Speed_Control_Mode       (SPEED_LOOP_CONTROL)                    ///< 外环环路选择

#define SPEED_LOOP_TIME                (5)                                     ///< (ms) 外环环路调节周期

/* -----Outer loop coefficient PI3----- */
#define SKP3                            _Q12(2.0)             //0.8                 ///< 外环KP
#define SKI3                            _Q15(0.05)           //0.012                  ///< 外环KI

#define SOUT3MAX                        I_Value(6.0)                           ///< (A) 外环最大限幅
#define SOUT3MIN                        I_Value(-0.02)                          ///< (A) 外环最小限幅

#define SPEED_INC                       60                                     ///< 外环目标值爬坡增量
#define SPEED_DEC                       60                                     ///< 外环目标值爬坡减量

/* -----Maximum and minimum value of speed regulation curve in speed control mode----- */
#define MOTOR_SPEED_MIN_RPM            (5000.0)                                ///< (RPM) 速度环给定最小转速
#define MOTOR_SPEED_MAX_RPM            (50000.0)                               ///< (RPM) 速度环给定最大转速

/* -----Maximum and minimum value of power regulation curve in power control mode----- */
#define MOTOR_POWER_MIN_RPM            (50.0)                                  ///< (RPM) 功率环给定最小功率
#define MOTOR_POWER_MAX_RPM            (200.0)                                 ///< (RPM) 功率环给定最大功率

/* ----------------------------------------------------------------------------------------------------------------------------
                                              6. FG输出
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  FG输出
 * @param (Disable)    禁止
 * @param (Enable)     使能
 */
#define FGEnable                        (Enable)                               ///< FG输出

#define FG_K                            (1.0)                                  ///< FG频率输出倍数

/* ----------------------------------------------------------------------------------------------------------------------------
                                              7. 过调制
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  过调制
 * @param (Disable)   禁止
 * @param (Enable)    使能
 */
#define OverModulation                 (Enable)                               ///< 开启过调制UD,UQ会被放大1.15倍，但极限状态可能导致电流畸变    

/* ----------------------------------------------------------------------------------------------------------------------------
                                              8. 调速模式
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  调速模式选择
 * @param (PWMMODE)          PWM调速
 * @param (SREFMODE)         模拟调速
 * @param (NONEMODE)         上电运行给定值不调速
 */
#define SPEED_MODE                     (NONEMODE)

/* ----------------------------------------------------------------------------------------------------------------------------
                                              9. 观测器模式 
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  观测器模式选择
 * @param (SMO)         SMO 滑膜估算
 * @param (PLL)         PLL 锁相环
 */
#define EstimateAlgorithm              (SMO)

/* ----------------------------------------------------------------------------------------------------------------------------
                                              10. 顺逆风模式配置
---------------------------------------------------------------------------------------------------------------------------- */

/**
 * @brief  顺逆风模式选择
 * @param (TailWind)         有顺逆风
 * @param (NoTailWind)       没有顺逆风
 */

#define TailWind_Mode                  (TailWind)
#define IQ_TailWind_CURRENT             I_Value(1.0)                            ///< (A) 顺风启动电流
#define Downwind                         (2)
#define Headwind                         (3)
#define Staticwind                       (1)

/**
 * @brief  顺逆风检测方式
 * @param (BEMFMethod)      BEMF比较器方法（默认，硬件需要反电动势检测电路）
 */
#define FRDetectMethod                 (BEMFMethod)

#define TailWind_Time                  (50)                                     ///< (ms) 顺逆风检测时间

#define DQKP_TailWind                  _Q12(0.5)                                ///顺风启动KP

#define DQKI_TailWind                  _Q15(0.01)                               ///顺风启动KI

#define ATO_BW_Wind                    (50.0)                                   /// 顺逆风判断观测器带宽的滤波值，经典值为8.0-100.0
#define SPD_BW_Wind                    (10.0)                                   /// 顺逆风判断速度带宽的滤波值，经典值为5.0-40.0


/* ----------------------------------------------------------------------------------------------------------------------------
                                              11. 启停测试参数 
---------------------------------------------------------------------------------------------------------------------------- */

#define StartONOFF_Enable              (0)                                      /// 启停测试 ，0:禁止;1:使能.

/* -----On/Off test time----- */
#define StartON_Time                   (3000)                                   ///< (ms) 运行时间
#define StartOFF_Time                  (5000)                                   ///< (ms) 停止时间

/* -----Reference in On/Off Test mode----- */
#define MOTOR_ONOFF_RPM                (3000.0)                                 ///< (RPM) 启停测试马达运行目标转速

/* ----------------------------------------------------------------------------------------------------------------------------
                                              12. 马达工作模式.
---------------------------------------------------------------------------------------------------------------------------- */


/**
 * @brief  马达工作模式
 * @param (NormalRun)     正常运行
 * @param (IPMtest)       测试模式，不接电机验证板子输出是否正常，测试模式下mcu输出固定15%占空比
 */
#define IPMState                       (NormalRun)                              ///< 马达运行模式


/* ----------------------------------------------------------------------------------------------------------------------------
                                              13. 刹车.
---------------------------------------------------------------------------------------------------------------------------- */

#define StopBrakeFlag                  (0)                                      ///< 停机刹车，0:禁止（自由停机）;1:使能.

#define StopWaitTime                   (2000)                                   ///< (ms) 刹车时间

#define MOTOR_SPEED_STOP_RPM           (2000)                                   ///< (RPM) 刹车转速

#endif
